import sys
import time
import random
import threading
from tkinter import messagebox
def yulubaodian():
    time.sleep(1)
    print("<<<<<<心灵鸡汤>>>>>>")
    time.sleep(0.5)
    print('“人都是逼出来的”')
    time.sleep(0.5)
    print('''每个人都是有潜能的，生于安乐，死于忧患,所以，当面对压力的时候，不要焦燥，也许这只是生活对你的一点小考验.
相信自己，一切都能处理好，逼急了好汉可以上梁山，时事造英雄，穷者思变，人只有压力才会有动力！''')
    time.sleep(0.5)
    print('“如果你简单，这个世界就对你简单”')
    time.sleep(0.5)
    print('''简单生活才能幸福生活，人要自足常乐，宽容大度，什么事情都不能想繁杂，心灵的负荷重了，就会怨天忧人。
要定期的对记忆进行一次删除，把不愉快的人和事从记忆中摈弃.
人生苦短，财富地位都是附加的，生不带来死不带去，简简单单的生活就是快快乐乐的生活。''')
    time.sleep(0.5)
    print('“人生没有彩排，每一天都是现场直播”')
    time.sleep(0.5)
    print('''偶尔会想，如果人生真如一场电子游戏，玩坏了可以选择重来，生活会变成什么样子？
正因为时光流逝一去不复返，每一天都不可追回，所以更要珍惜每一寸光阴，孝敬父母、疼爱孩子、体贴爱人、善待朋友、珍惜自己机会''')
    time.sleep(3)
